test/Malle/LES/diff_9species/0.orig/N2
/*--------------------------------*- C++-*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.7558961;

boundaryField
{
    jetInlet
    {
        type            fixedValue;
        value           uniform 0.7558961;   // phi_g=0.5, both fresh and burnt
    }

    coflowInletBottom
    {
        type            fixedValue;
        value           uniform 0.7558961;
    }

    coflowInletTop
    {
        type            fixedValue;
        value           uniform 0.7558961;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    topWall
    {
        type            zeroGradient;
    }

    front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
