test/Malle/LES/diff_9species/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

//internalField   uniform 1646.5095081054;
internalField   uniform 300.;

boundaryField
{
    jetInlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    topWall
    {
        type            zeroGradient;
    }

    coflowInletBottom
    {
        type            fixedValue;
        value           uniform 1646.5095081054;
        //value           uniform 300;
    }

    coflowInletTop
    {
        type            fixedValue;
        value           uniform 1646.5095081054;
        //value           uniform 300;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1646.5095081054;
        value           uniform 1646.5095081054;
        //inletValue      uniform 300.;
        //value           uniform 300.;
    }

    front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
